brew "stow"                      # stow
brew "zsh"                       # zsh
brew "sheldon"                   # sheldon
brew "mosh"                      # mosh
brew "tmux"                      # tmux
brew "lazygit"                   # lazygit
brew "make"                      # make
brew "fzf"                       # fzf
brew "watch"                     # watch
brew "awk"                       # awk
brew "gh"                        # github cli
brew "git-delta"                 # diff
brew "git-secrets"               # git secrets
brew "llvm"                      # llvm
brew "glow"                      # glow
brew "universal-ctags"           # universal-ctags
brew "duf"                       # duf
brew "youtube-dl"                # youtube-dl
brew "awscli"                    # awscli
brew "aws-iam-authenticator"     # aws-iam-authenticator
brew "emacs"                     # emacs
brew "cirruslabs/cli/tart"       # tart
brew "iperf3"                    # iperf3
brew "protobuf"                  # protobuf
brew "bufbuild/buf/buf"          # buf
brew "mkcert"                    # mkcert
brew "emscripten"                # emscripten
brew "stepci"                    # stepci

# Window manager
brew "koekeishiya/formulae/yabai" # yabai -> tile window manager
brew "koekeishiya/formulae/skhd"  # skhd -> keyboard shortcuts

brew "neovim"                 # neovim
brew "luajit"                 # luajit
brew "tree-sitter"            # tree-sitter -> syntax highlighting

# Better tools
brew "eza"                    # eza -> better ls
brew "bat"                    # bat -> better cat
brew "xsv"                    # xsv -> better csv
brew "gping"                  # gping -> better ping
brew "httpie"                 # httpie -> better curl
brew "fd"                     # fd -> better find
brew "ripgrep"                # ripgrep -> better grep
brew "choose-rust"            # choose-rust -> better cut
brew "zoxide"                 # zoxide -> better z
brew "viddy"                  # viddy -> better watch
brew "peco"                   # peco -> better history search
brew "pget"                   # pget -> better wget
brew "btop"                   # btop -> better top
brew "procs"                  # procs -> better ps
brew "jless"                  # jless -> better jq
brew "tokei"                  # tokei -> count lines
brew "wrk"                    # wrk -> HTTP benchmark tool
brew "hyperfine"              # hyperfine -> better time
brew "hexyl"                  # hexyl -> better xxd
brew "grex"                   # grex -> better regex
brew "difftastic"             # difftastic -> better diff

# Rust
brew "rust-analyzer"          # rust-analyzer
brew "sccache"                # sccache
brew "z3"                     # z3
brew "binaryen"               # binaryen
brew "cargo-nextest"          # cargo-nextest

# Node.JS
brew "volta"                      # volta -> node
brew "typescript"                 # typescript
brew "snyk/tap/snyk"              # snyk
brew "oven-sh/bun/bun"            # bun
brew "fsouza/prettierd/prettierd" # prettierd

# Other languages
brew "stylua"                 # stylua
brew "yamlfmt"                # yamlfmt
brew "gcc"                    # gcc
brew "python"                 # python
brew "go"                     # go
brew "autoconf"               # autoconf
brew "cocoapods"              # cocoapods
brew "hadolint"               # hadolint
brew "qemu"                   # qemu
brew "dive"                   # dive

# Cask
cask "homebrew/cask-fonts/font-fira-code-nerd-font" # fira-code
cask "homebrew/cask-fonts/font-fira-mono-nerd-font" # fira-mono
cask "zed"                                          # zed
cask "coteditor"                                    # coteditor
cask "httpie"                                       # httpie
cask "wezterm"                                      # wezterm
cask "rio"                                          # rio
# cask "kitty"                                      # kitty
# cask "alacritty"                                  # alacritty
# cask "hyper"                                      # hyper
cask "1password/tap/1password-cli"                  # 1password-cli
cask "karabiner-elements"                           # karabiner-elements
cask "hammerspoon"                                  # hammerspoon
cask "keycastr"                                     # keycastr
cask "raycast"                                      # raycast
cask "tableplus"                                    # tableplus
cask "alt-tab"                                      # alt-tab
cask "proxyman"                                     # proxyman
cask "finch"                                        # finch
cask "arc"                                          # arc
cask "monitorcontrol"                               # monitorcontrol
cask "cron"                                         # cron
cask "linearmouse"                                  # linearmouse
cask "flutter"                                      # flutter
cask "android-studio"                               # android-studio
