brew "stow"                      # stow
brew "zsh"                       # zsh
brew "sheldon"                   # sheldon
brew "mosh"                      # mosh
brew "tmux"                      # tmux
brew "lazygit"                   # lazygit
brew "make"                      # make
brew "fzf"                       # fzf
brew "awk"                       # awk
brew "gh"                        # github cli
brew "git-delta"                 # diff
brew "git-secrets"               # git secrets
brew "llvm"                      # llvm
brew "glow"                      # glow
brew "universal-ctags"           # universal-ctags
brew "duf"                       # duf
brew "youtube-dl"                # youtube-dl
brew "awscli"                    # awscli
brew "aws-iam-authenticator"     # aws-iam-authenticator
brew "emacs"                     # emacs
brew "cirruslabs/cli/tart"       # tart
brew "iperf3"                    # iperf3
brew "protobuf"                  # protobuf
brew "bufbuild/buf/buf"          # buf
brew "mkcert"                    # mkcert
brew "7-zip"                     # 7zip
# brew "emscripten"                # emscripten

# Temporary
#
brew "azure-cli"                                    # Azure CLI
brew "azure/functions/azure-functions-core-tools@4" # Azure Functions Core Tools

# Window manager
brew "koekeishiya/formulae/yabai"  # yabai -> tile window manager
brew "koekeishiya/formulae/skhd"   # skhd -> keyboard shortcuts
brew "FelixKratz/formulae/borders" # borders -> window borders

brew "neovim"                 # neovim
brew "luajit"                 # luajit
brew "tree-sitter"            # tree-sitter -> syntax highlighting

# Better tools
brew "eza"                    # eza -> better ls
brew "bat"                    # bat -> better cat
brew "gping"                  # gping -> better ping
brew "httpie"                 # httpie -> better curl
brew "fd"                     # fd -> better find
brew "ripgrep"                # ripgrep -> better grep
brew "choose-rust"            # choose-rust -> better cut
brew "zoxide"                 # zoxide -> better z
brew "viddy"                  # viddy -> better watch
brew "peco"                   # peco -> better history search
brew "pget"                   # pget -> better wget
brew "btop"                   # btop -> better top
brew "procs"                  # procs -> better ps
brew "jless"                  # jless -> better jq
brew "tokei"                  # tokei -> count lines
brew "wrk"                    # wrk -> HTTP benchmark tool
brew "hyperfine"              # hyperfine -> better time
brew "hexyl"                  # hexyl -> better xxd
brew "grex"                   # grex -> better regex
brew "difftastic"             # difftastic -> better diff

# Rust
brew "rust-analyzer"          # rust-analyzer
brew "sccache"                # sccache
brew "z3"                     # z3
brew "binaryen"               # binaryen
brew "cargo-nextest"          # cargo-nextest
brew "wasm-tools"             # wasm-tools
brew "wasmtime"               # wasmtime

# gRPC
brew "protobuf"               # protobuf
brew "grpcurl"                # grpcurl

# Other languages
brew "uv"                     # uv
brew "stylua"                 # stylua
brew "yamlfmt"                # yamlfmt
brew "gcc"                    # gcc
brew "autoconf"               # autoconf
brew "cocoapods"              # cocoapods
brew "hadolint"               # hadolint
brew "qemu"                   # qemu
brew "dive"                   # dive
brew "opentofu"               # opentofu

brew "mise"

# Fonts
cask "homebrew/cask-fonts/font-fira-code-nerd-font" # fira-code
cask "homebrew/cask-fonts/font-fira-mono-nerd-font" # fira-mono
cask "homebrew/cask-fonts/font-0xproto-nerd-font"   # 0xproto
cask "homebrew/cask-fonts/font-monaspace-nerd-font" # monaspace

# Cask
cask "zed"                                          # zed
# cask "zed@preview"                                  # zed@preview
cask "visual-studio-code@insiders"                  # visual-studio-code@insiders
# cask "httpie"                                       # httpie
cask "wezterm@nightly"                              # wezterm
cask "ghostty"                                      # ghostty
cask "1password-cli"                                # 1password-cli
cask "karabiner-elements"                           # karabiner-elements
cask "hammerspoon"                                  # hammerspoon
cask "raycast"                                      # raycast
# cask "tableplus"                                    # tableplus
cask "alt-tab"                                      # alt-tab
cask "proxyman"                                     # proxyman
cask "arc"                                          # arc
cask "orbstack"                                     # orbstack
cask "monitorcontrol"                               # monitorcontrol
cask "linearmouse"                                  # linearmouse
cask "notion-calendar"                              # notion-calendar
cask "readdle-spark"                                # spark
# cask "flutter"                                      # flutter
# cask "android-studio"                               # android-studio
