brew "stow"                   # stow
brew "zsh"                    # zsh
brew "mosh"                   # mosh
brew "exa"                    # exa -> better ls
brew "bat"                    # bat -> better cat
brew "gping"                  # gping -> better ping
brew "httpie"                 # httpie -> better curl
brew "tldr"                   # tldr -> preview markdown
brew "fzf"                    # fzf
brew "fd"                     # fd -> better find
brew "ripgrep"                # ripgrep -> better grep
brew "zoxide"                 # zoxide -> better z
brew "nkf"                    # nkf -> better cat
brew "universal-ctags"        # universal-ctags
brew "the_silver_searcher"    # the_silver_searcher -> better ag
brew "peco"                   # peco -> history search
brew "watch"                  # watch
brew "pget"                   # pget -> better wget
brew "htop"                   # htop -> better top
brew "bottom"                 # bottom -> better htop
brew "procs"                  # procs -> better ps
brew "make"                   # make
brew "bazel"                  # bazel
brew "opensc"                 # opensc
brew "gh"                     # github
brew "tig"                    # git
brew "git-delta"              # diff
brew "git-secrets"            # git-secrets
brew "pkg-config"             # pkg-config
brew "zlib"                   # zlib
brew "librsync"               # librsync
brew "libpng"                 # libpng
brew "ImageMagick"            # imagemagick
brew "pygments"               # pygments
brew "harfbuzz"               # harfbuzz
brew "sphinx-doc"             # sphinx-doc
brew "lcms2"                  # lcms2
brew "dep"                    # dep
brew "llvm"                   # llvm
brew "ninja"                  # ninja
brew "glow"                   # glow
brew "csview"                 # csview
brew "mdcat"                  # mdcat -> preview markdown
brew "jless"                  # jless -> better jq
brew "tokei"                  # tokei -> count lines
brew "wrk"                    # wrk -> HTTP benchmark tool
brew "hyperfine"              # hyperfine -> benchmark
brew "dive"                   # dive
brew "silicon"                # silicon
brew "tree-sitter"            # tree-sitter -> syntax highlighting
brew "yabai"                  # yabai -> tile manager
brew "skhd"                   # skhd -> keyboard shortcuts
brew "tmux"                   # tmux
brew "neovim"                 # neovim
brew "luajit"                 # luajit
brew "awscli"                 # awscli
brew "aws-iam-authenticator"  # aws-iam-authenticator
brew "youtube-dl"             # youtube-dl
brew "figlet"                 # figlet
brew "cmatrix"                # cmatrix
brew "macchina"               # macchina -> better watch
brew "rust-analyzer"          # rust-analyzer
brew "sccache"                # sccache
brew "z3"                     # z3
brew "binaryen"               # binaryen
brew "wabt"                   # wabt
brew "ghc"                    # ghc
brew "deno"                   # deno
brew "dart"                   # dart
brew "volta"                  # volta
brew "yarn"                   # yarn
brew "pnpm"                   # pnpm -> better npm
brew "typescript"             # typescript
brew "snyk"                   # snyk
brew "eslint"                 # eslint
brew "prettier"               # prettier
brew "stylua"                 # stylua
brew "gcc"                    # gcc
brew "python"                 # python
brew "pipx"                   # pipx
brew "go"                     # go
brew "java"                   # java
brew "kotlin"                 # kotlin
brew "ktlint"                 # ktlint
brew "sbt"                    # sbt -> scala build tool
brew "autoconf"               # autoconf
brew "terraform"              # terraform
brew "vault"                  # vault
brew "cocoapods"              # cocoapods
brew "lima"                   # lima
brew "dagger/tap/dagger"       # dagger
brew "cue"                    # cue
brew "qemu"                   # qemu
brew "michaeleisel/zld/zld"   # linker
brew "marp-cli"               # marp cli

cask "google-chrome"          # google-chrome
cask "firefox"                # firefox
cask "deepl"                  # deepl
cask "tableplus"              # tableplus
cask "insomnia"               # insomnia
cask "karabiner-elements"     # karabiner-elements
cask "hammerspoon"            # hammerspoon
cask "keycastr"               # keycastr
cask "raycast"                # raycast
